<?php
/**
 * Отримати коректний шлях замінивши всі > на справжній сепаратор директорій для поточної операційної системи.
 * Потрібно використовувати для обробки всіх шляхів (окрім URL) щоб дозволити безпечне перенесення коду між пристроями з різними ОС.
 * 
 * @param string $path для розділення директорій використовувати ТІЛЬКИ знак більше (наприклад: path>to>file.php)
 * 
 * ***Не використовуйте / або \ адже функція їх не приводе у відповідність до ОС***
 */
function pathReplace(string $path): string {
    return str_replace('>', DS, $path);
}
